{
        "projectMetadata": {
            "projectName": "My NC1 Story",
            "projectGoal": "새싹톤에서 시도해 본, ‘디자이너 입장에서 개발자와 소통하는 법’에 대해 사람들에게 공유하기",
            "presentationTime": 300,
            "createAt": "null"
        },
        "projectDocument": {
            "PDFPages": [
                {
                    "keywords": [ "개발자", "소통" ],
                    "script": "개발자와 소통하는 법에 대해 알아보았습니다."
                },
                {
                    "keywords": [ "브릿지", "프로세스" ],
                    "script": "브릿지 기간에 각 분야별로 Learning Radar를 진행했었는데, 저는 여기서 process."
                },
                {
                    "keywords": [ "쉐어링", "갭" ],
                    "script": "그 중 sharing에 초점을 맞춰 sharing에 대한 gap을 채우고자 했습니다."
                },
                {
                    "keywords": [ "예시", "피그마", "Xcode" ],
                    "script": "MC2에서 저는 sharing에 대해 gap을 느꼈는데요, 예시를 하나 보여드리겠습니다. 이건 MC2에서 figma로 진행했던 view 중 하나이고, 이건 xcode에서 실제로 코드로 구현된 view입니다."
                },
                {
                    "keywords": [ "차이", "디테일", "디자이너", "개발자", "소통", "잘", "전달" ],
                    "script": "폰트 굵기부터, 폰트 색깔, 그리고 라운딩 디테일 등 figma와 Xcode에 차이가 있었고, 자세한 디테일 또한 달랐습니다. 저는 이렇게 figma와 Xcode 사이에 차이가 생긴 이유가, 디자이너와 개발자 사이에 소통이 부족했기 때문이라고 생각했는데요 특히 디자이너인 제 입장에서 개발자에게 좀 더 디자인을 잘 전달하는 법이 있을 것이라고 생각했습니다."
                },
                {
                    "keywords": [ "소통", "방법" ],
                    "script": "그래서 개발자와 좀 더 원활하게 소통 할 수 있는 방법을 찾아, 제 gap을 채우고자 했습니다."
                },
                {
                    "keywords": [ "HIG", "타이포그래피", "가독성", "자동", "사이즈", "일관된", "개발자" ],
                    "script": "HIG로 흔히 알고 있는 Human Interface Guidelines의 Typography 파트에 보면, 동적 타이포그래피에 대해 설명이 되어 있습니다. 동적 타이포그래피는 화면의 크기, 해상도, 장치 등과 같은 다양한 요소에 따라 자동으로 폰트, 크기, 간격 등을 조정하는 디자인 접근 방식이라, 이를 이용하면 텍스트를 더욱 가독성 있게 표시할 수 있다고 합니다. 화면을 보시면 HIG에서 지정해둔 여러 style들이 있고, 화면 크기가 미디움인지 라지인지에도 따라 자동으로 글씨 사이즈가 변하게 지정되어 있는 것을 보실 수 있으실텐데요, 디자인 단계에서부터 이런 text style을 사용하면 폰트 크기나 굵기 등을 하나하나 맞춰줄 필요가 없고, 일관된 스타일을 유지할 수 있으니, 개발자 입장에서도 개발하기 좀 더 편할 것 같다는 생각이 들었습니다."
                },
                {
                    "keywords": [ "스타일", "가이드", "폰트", "이름", "컬러", "아이콘" ],
                    "script": "그래서 하이파이 프로토타입을 만들면서 Style Guide를 지정했습니다. iOS 기본폰트인 SF Pro를 사용했고 기기도 지정해두었으며, text style에는 색과 스타일을 지정해두고 headline, body, button 등 이름을 붙여 각각 스타일들이 어디에 사용되는지 명확히 전달하도록 노력했습니다. 컬러도 정리해두었고, icon도 어떤 icon을 사용했는지 특히 sf symbol을 사용한 경우에는 사용한 sf symbol 이름까지 적어두었습니다."
                },
                {
                    "keywords": [ "프로토타입", "코멘트", "귀찮", "쉽게" ],
                    "script": "이러한 style guide를 참고해 하이파이 프로토타입에서 뷰를 그릴 때마다 한 줄 단위로 text style 이름 및 색을 지정해 코멘트를 달아두어, 개발자가 개발할 때 편하게 참고할 수 있도록 했습니다. 물론 시간은 더 많이 들었고, 상당히 귀찮고 헷갈리는 작업이었지만, 개발자로부터 프로토타입만을 보고 별도의 설명 없이 쉽게 이해할 수 있어 좋았다는 평가를 들었습니다."
                },
                {
                    "keywords": [ "스타일", "케이스", "지정", "편리", "효율적", "공유" ],
                    "script": "또한 정리된 가이드라인을 보고 xcode에서 뷰를 그리기 전, 그대로 text style 및 굵기, 컬러를 case 별로 지정해둘 수 있었는데, 후에 뷰를 그릴 때 그저 사용하기 원하는 text style의 이름만 적어 미리 지정해둔 스타일을 그대로 적용시켰기 때문에 편리했다는 평도 들었습니다. 하지만 이런 방법은 제가 임의로 사용한 방법이고, 더 나은 방법이나 효율적인 방법이 있을 것이라고 생각합니다. 혹시 아시는 분들이 공유해주시면 MC3나 매크로 때 개발자와의 협업하고 소통함에 있어 부족한 저의 gap을 좀 더 채울 수 있을 것이라고 생각합니다!"
                },
                {
                    "keywords": [ "결론적", "Xcode", "디테일" ],
                    "script": "결론적으로 이 방법을 통해 figma를 개발자에게 넘겨 직접 뷰를 그려보게 한 결과, figma 뷰와 비교했을 때, Xcode에서도 좀 더 디테일이 잡힌 뷰가 완성될 수 있었습니다."
                },
                {
                    "keywords": [ "테드", "메세지", "패딩" ],
                    "script": "테드에게 전하는 메세지로 발표 마무리하도록 하겠습니다 테드… 그러니까 이 뷰 디테일도 잡을 수 있어요 패딩 맞춰주세요…!"
                },
                {
                    "keywords": [ "감사" ],
                    "script": "감사합니다."
                }
            ],
            "PDFGroups": [
                {
                    "name": "그룹 - 1",
                    "range": {
                        "start": 0,
                        "end": 2
                    },
                    "setTime": 30
                },
                {
                    "name": "그룹 - 2",
                    "range": {
                        "start": 3,
                        "end": 5
                    },
                    "setTime": 120
                },
                {
                    "name": "그룹 - 3",
                    "range": {
                        "start": 6,
                        "end": 6
                    },
                    "setTime": 60
                },
                {
                    "name": "그룹 - 4",
                    "range": {
                        "start": 7,
                        "end": 8
                    },
                    "setTime": 120
                },
                {
                    "name": "그룹 - 5",
                    "range": {
                        "start": 9,
                        "end": 9
                    },
                    "setTime": 60
                },
                {
                    "name": "그룹 - 6",
                    "range": {
                        "start": 10,
                        "end": 12
                    },
                    "setTime": 30
                }
            ]
        },
        "practices": [
            {
                "saidKeywords": [
                    ["개발자", "소통"],
                    ["브릿지"],
                    ["쉐어링"],
                    [],
                    [],
                    [],
                    [],
                    [],
                    [],
                    [],
                    [],
                    [],
                    []
                ],
                "speechRanges": [
                        {"start": 0, "group": 0},
                        {"start": 11, "group": 1},
                        {"start": 23, "group": 2},
                        {"start": 30, "group": 3}
                ],
                "progressTime": 300,
                "audioPath": "file:///Users/leeyongjun/Library/Containers/kkojangro.ForJaeRin/Data/Documents/2023-07-25at20:32:03.m4a"
            }
        ]
}
